[
   {
      "states":[
         {
            "id":1,
            "title":"Bihar",
            "cities":[
               {
                  "id":1,
                  "name":"Patna",
                  "description":"Patna is the capital and largest city of Bihar."
               },
               {
                  "id":2,
                  "name":"Gaya",
                  "description":"Gaya is a holy city in Bihar, known for its famous Vishnupad Temple."
               },
               {
                  "id":3,
                  "name":"Muzaffarpur",
                  "description":"Muzaffarpur is a commercial hub in Bihar, famous for its litchi fruit."
               },
               {
                  "id":4,
                  "name":"Bhagalpur",
                  "description":"Bhagalpur is a city in Bihar, known for its silk industry."
               },
               {
                  "id":5,
                  "name":"Darbhanga",
                  "description":"Darbhanga is a city in Bihar, famous for its Mithila paintings.."
               },
               {
                  "id":6,
                  "name":"Purnia",
                  "description":"Purnia is a city in Bihar, known for its agriculture and trade."
               }
            ],
            "about":"Bihar is a state in eastern India, with Patna as its capital. The state has a rich cultural and historical heritage, and is known for its famous Buddhist sites, such as Bodh Gaya and Rajgir. Bihar is also known for its agriculture and industries, such as textiles, sugar, and chemicals.",
            "attractions":[
               {
                  "id":1,
                  "name":"Bodh Gaya",
                  "description":"Bodh Gaya is a famous Buddhist pilgrimage site in Bihar, where Lord Buddha is said to have attained enlightenment.",
                  "image":"https://images.unsplash.com/photo-1538122538818-ab5426a4d5ba?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1776&q=80"
               },
               {
                  "id":2,
                  "name":"Nalanda University",
                  "description":"Nalanda University is an ancient Buddhist university in Bihar, which was one of the world's first universities.",
                  "image":"https://images.unsplash.com/photo-1670597786308-5d3e2d1436be?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":3,
                  "name":"Mahabodhi Temple",
                  "description":"Mahabodhi Temple is a UNESCO World Heritage site in Bodh Gaya, Bihar, which is one of the oldest brick temples in India.",
                  "image":"https://images.unsplash.com/photo-1666006903005-29e1ea1c8a47?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":4,
                  "name":"Vishnupad Temple",
                  "description":"Vishnupad Temple is a famous Hindu temple in Gaya, Bihar, dedicated to Lord Vishnu.",
                  "image":"https://images.unsplash.com/photo-1602772576452-2728cd3bca17?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1771&q=80"
               },
               {
                  "id":5,
                  "name":"Golghar",
                  "description":"Golghar is a historic granary in Patna, Bihar, which was built in the 18th century to store grains.",
                  "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Golghar_%E0%A5%AA.jpg/500px-Golghar_%E0%A5%AA.jpg"
               }
            ],
            "thingsToDo":[
               {
                  "id":1,
                  "name":"Boating in Ganges",
                  "description":"Take a boat ride on the holy river Ganges in Patna and experience the spiritual side of Bihar.",
                  "image":"https://images.unsplash.com/photo-1558184525-2218e8c34914?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":2,
                  "name":"Litchi Picking",
                  "description":"Visit Muzaffarpur during litchi season and experience the joy of picking and eating fresh litchis.",
                  "image":"https://images.unsplash.com/photo-1643100569574-603f0739a50f?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":3,
                  "name":"Visit Mithila Paintings",
                  "description":"Visit Darbhanga and explore the vibrant Mithila paintings, which are famous for their intricate designs and colors.",
                  "image":"https://5.imimg.com/data5/ANDROID/Default/2021/4/JM/DI/UK/127161346/product-jpeg-500x500.jpg"
               },
               {
                  "id":4,
                  "name":"Explore the Caves",
                  "description":"Visit the Barabar Caves in Bihar, which are ancient rock-cut caves and are believed to be some of the oldest surviving rock-cut structures in India.",
                  "image":"https://images.unsplash.com/photo-1459356067573-0a190eb1fcf5?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1769&q=80"
               },
               {
                  "id":5,
                  "name":"Visit Waterfalls",
                  "description":"Explore the natural beauty of Bihar by visiting some of its beautiful waterfalls, such as Karkat Waterfall, Sahastradhara Waterfall, and Hundru Waterfall.",
                  "image":"https://images.unsplash.com/photo-1531698451051-18c97580aeb2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80"
               }
            ],
            "events":[
               {
                  "id":1,
                  "name":"Chhath Puja",
                  "description":"Chhath Puja is a popular Hindu festival in Bihar, celebrated to thank the Sun God for sustaining life on Earth.",
                  "image":"https://images.unsplash.com/photo-1636520940045-f6ee6963c1d7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":2,
                  "name":"Sonepur Mela",
                  "description":"Sonepur Mela is a popular annual cattle fair in Bihar, which is known for its wide variety of animals and birds.",
                  "image":"https://images.unsplash.com/photo-1560849566-a36b74f920e2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2940&q=80"
               },
               {
                  "id":3,
                  "name":"Rajgir Mahotsav",
                  "description":"Rajgir Mahotsav is a cultural festival held in Rajgir, Bihar, which showcases the rich heritage and traditions of the state.",
                  "image":"https://images.unsplash.com/photo-1531698451051-18c97580aeb2?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=774&q=80"
               },
               {
                  "id":4,
                  "name":"Bihar Diwas",
                  "description":"Bihar Diwas is celebrated on March 22 every year, to commemorate the formation of the state of Bihar.",
                  "image":"https://images.unsplash.com/photo-1656663786249-7acf9bfcb79d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":5,
                  "name":"Pitrapaksha Mela",
                  "description":"Pitrapaksha Mela is a Hindu festival held in Gaya, Bihar, where people offer prayers to their ancestors.",
                  "image":"https://images.unsplash.com/photo-1662727736417-331a09304025?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2745&q=80"
               }
            ],
            "facts":[
               "Bihar is the 13th largest state in India by area.",
               "The official language of Bihar is Hindi.",
               "The literacy rate of Bihar is 61.8%.",
               "Bihar has a population of over 120 million people.",
               "The state of Bihar was formed on March 22, 1912.",
               "Bihar shares its borders with Uttar Pradesh, West Bengal, Jharkhand, and Nepal.",
               "The famous Mauryan emperor Ashoka was born in Patna, Bihar.",
               "Bihar is known for its famous sweet dish, the 'litti-chokha'."
            ]
         },
         {
            "id":2,
            "title":"Punjab",
            "cities":[
               {
                  "id":1,
                  "name":"Chandigarh",
                  "description":"Chandigarh is the capital city of both Punjab and Haryana and serves as a Union Territory."
               },
               {
                  "id":2,
                  "name":"Amritsar",
                  "description":"Amritsar is a major city in Punjab, known for the Golden Temple and its historical significance."
               },
               {
                  "id":3,
                  "name":"Ludhiana",
                  "description":"Ludhiana is the largest city in Punjab and an important industrial and commercial center."
               },
               {
                  "id":4,
                  "name":"Jalandhar",
                  "description":"Jalandhar is a city in Punjab, known for its sports industry and historical landmarks."
               },
               {
                  "id":5,
                  "name":"Patiala",
                  "description":"Patiala is a city in Punjab, famous for its royal heritage and cultural richness."
               },
               {
                  "id":6,
                  "name":"Amritsar",
                  "description":"Amritsar is a major city in Punjab, known for the Golden Temple and its historical significance."
               }
            ],
            "about":"Punjab is a state located in northern India, with Chandigarh serving as its shared capital with Haryana. The state is known for its fertile land, rich agricultural production, and vibrant cultural heritage. Punjab is often referred to as the 'Land of Five Rivers' due to the presence of the Beas, Chenab, Jhelum, Ravi, and Sutlej rivers. It has a significant Sikh population and is home to many important religious sites for Sikhs.",
            "attractions":[
               {
                  "id":1,
                  "name":"Golden Temple",
                  "description":"The Golden Temple, also known as Harmandir Sahib, is the holiest Gurudwara of Sikhism and a major pilgrimage site in Amritsar, Punjab.",
                  "image":"https://images.unsplash.com/photo-1587899765642-3f8e3ea67852?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2231&q=80"
               },
               {
                  "id":2,
                  "name":"Jallianwala Bagh",
                  "description":"Jallianwala Bagh is a public garden in Amritsar, Punjab, which commemorates the massacre of peaceful protestors by British forces in 1919.",
                  "image":"https://images.unsplash.com/photo-1592013079736-2408be506279?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2942&q=80"
               },
               {
                  "id":3,
                  "name":"Wagah Border",
                  "description":"The Wagah Border is a famous border crossing between India and Pakistan, located near Amritsar, where the daily flag lowering ceremony attracts numerous visitors.",
                  "image":"https://images.unsplash.com/photo-1598431416007-869a2a727f8b?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=954&q=80"
               },
               {
                  "id":4,
                  "name":"Anandpur Sahib",
                  "description":"Anandpur Sahib is a sacred city in Punjab and holds immense religious importance for Sikhs. It is known for hosting the annual Hola Mohalla festival.",
                  "image":"https://images.unsplash.com/photo-1554773263-e3d834ba5d6f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2942&q=80"
               }
            ],
            "thingsToDo":[
               {
                  "id":1,
                  "name":"Visit the Punjab State Museum",
                  "description":"Explore the rich history and culture of Punjab by visiting the Punjab State Museum in Chandigarh. It houses a vast collection of artifacts, including ancient sculptures, manuscripts, and artworks.",
                  "image":"https://images.unsplash.com/photo-1651910031229-d6b1e6d0308d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":2,
                  "name":"Enjoy a boat ride in Sukhna Lake",
                  "description":"Sukhna Lake in Chandigarh offers a serene ambiance and is perfect for a leisurely boat ride. Enjoy the scenic beauty, go for a stroll, or indulge in various water activities.",
                  "image":"https://images.unsplash.com/photo-1614687345141-7c9e45e3b223?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80"
               },
               {
                  "id":3,
                  "name":"Experience rural life at a Punjabi village",
                  "description":"Visit a Punjabi village to experience the vibrant rural life of Punjab. Witness traditional farming practices, enjoy folk music and dance performances, and savor authentic Punjabi cuisine.",
                  "image":"https://images.unsplash.com/photo-1523760957528-55d1d540360d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":4,
                  "name":"Attend the Baisakhi Festival",
                  "description":"Celebrate the vibrant Baisakhi festival in Punjab, marking the harvest season and the formation of the Khalsa Panth. Enjoy lively processions, traditional music, and dance performances.",
                  "image":"https://images.unsplash.com/photo-1647534537365-ebbc5efda955?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1180&q=80"
               }
            ],
            "events":[
               {
                  "id":1,
                  "name":"Hola Mohalla",
                  "description":"Hola Mohalla is a Sikh festival held annually at Anandpur Sahib in Punjab. It showcases various martial arts, mock battles, and spiritual lectures.",
                  "date":"March 14-16, 2023",
                  "location":"Anandpur Sahib, Punjab"
               },
               {
                  "id":2,
                  "name":"Heritage and Tourism Fair",
                  "description":"The Heritage and Tourism Fair is a cultural extravaganza held in Amritsar, showcasing the rich heritage, art, and craft of Punjab.",
                  "date":"October 20-22, 2023",
                  "location":"Amritsar, Punjab"
               },
               {
                  "id":3,
                  "name":"Chhapar Mela",
                  "description":"Chhapar Mela is a traditional fair held in Chhapar village, Punjab, featuring folk music, dance, and various rural sports.",
                  "date":"September 25-27, 2023",
                  "location":"Chhapar, Punjab"
               },
               {
                  "id":4,
                  "name":"Punjab International Trade Expo",
                  "description":"The Punjab International Trade Expo is a major trade fair held in Ludhiana, showcasing a wide range of industries and products from Punjab.",
                  "date":"November 15-20, 2023",
                  "location":"Ludhiana, Punjab"
               }
            ],
            "facts":[
               "Punjab is known for its agricultural productivity and is often referred to as the 'Granary of India' due to its significant contribution to the nation's food supply.",
               "The Golden Temple in Amritsar attracts millions of visitors from all over the world and is considered one of the most spiritually significant places for Sikhs.",
               "Punjab has a rich tradition of Bhangra and Giddha, energetic folk dances that are an integral part of the Punjabi culture.",
               "The Punjabi cuisine is renowned for its rich flavors and variety, with popular dishes like butter chicken, sarson da saag, and makki di roti.",
               "Punjab shares a border with Pakistan and is known for its historical significance in the partition of India in 1947.",
               "The state has made significant contributions to the fields of sports, entertainment, and music, with many renowned athletes, actors, and musicians hailing from Punjab.",
               "Punjab has a well-developed transportation infrastructure, including airports, railways, and an extensive road network connecting major cities and towns.",
               "The state government of Punjab has implemented several initiatives to promote education, healthcare, and women empowerment in the region."
            ]
         },
         {
            "id":3,
            "title":"Goa",
            "cities":[
               {
                  "id":1,
                  "name":"Panaji",
                  "description":"Panaji is the capital city of Goa and a popular tourist destination known for its scenic beauty and Portuguese architecture."
               },
               {
                  "id":2,
                  "name":"Margao",
                  "description":"Margao is the second-largest city in Goa and a commercial hub famous for its markets and vibrant culture."
               },
               {
                  "id":3,
                  "name":"Vasco da Gama",
                  "description":"Vasco da Gama is a coastal city in Goa known for its port and beaches, and it serves as the gateway to the state."
               },
               {
                  "id":4,
                  "name":"Calangute",
                  "description":"Calangute is a popular beach town in North Goa known for its lively atmosphere, water sports, and nightlife."
               },
               {
                  "id":5,
                  "name":"Anjuna",
                  "description":"Anjuna is a coastal village in Goa famous for its scenic beach, flea market, and vibrant trance music scene."
               },
               {
                  "id":6,
                  "name":"Old Goa",
                  "description":"Old Goa, also known as Velha Goa, is a UNESCO World Heritage Site and an ancient city that was the capital of Portuguese India."
               }
            ],
            "about":"Goa is a state in western India known for its stunning beaches, vibrant nightlife, and Portuguese influence. It is a popular tourist destination that attracts visitors from around the world. Goa offers a unique blend of natural beauty, rich history, delicious cuisine, and a relaxed lifestyle. The state is also famous for its colonial-era architecture, churches, and temples.",
            "attractions":[
               {
                  "id":1,
                  "name":"Baga Beach",
                  "description":"Baga Beach is one of the most popular beaches in Goa, known for its scenic beauty, water sports, and beach shacks.",
                  "image":"https://images.unsplash.com/photo-1560179406-1c6c60e0dc76?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":2,
                  "name":"Dudhsagar Falls",
                  "description":"Dudhsagar Falls is a majestic four-tiered waterfall located on the Mandovi River, surrounded by lush greenery.",
                  "image":"https://images.unsplash.com/photo-1625125959362-304b1599a37f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80"
               },
               {
                  "id":3,
                  "name":"Fort Aguada",
                  "description":"Fort Aguada is a well-preserved Portuguese fort in Goa, offering panoramic views of the Arabian Sea and the surrounding areas.",
                  "image":"https://images.unsplash.com/photo-1643648057645-9974be381c38?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":4,
                  "name":"Anjuna Flea Market",
                  "description":"Anjuna Flea Market is a vibrant open-air market in Goa where you can find a wide range of goods, including clothing, accessories, handicrafts, and souvenirs.",
                  "image":"https://images.unsplash.com/photo-1562470552-c373eb83fe89?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2832&q=80"
               },
               {
                  "id":5,
                  "name":"Basilica of Bom Jesus",
                  "description":"The Basilica of Bom Jesus is a UNESCO World Heritage Site and a famous church in Old Goa that houses the mortal remains of St. Francis Xavier.",
                  "image":"https://images.unsplash.com/photo-1645450350532-f23817cf1562?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=870&q=80"
               },
               {
                  "id":6,
                  "name":"Dona Paula",
                  "description":"Dona Paula is a popular viewpoint and beach in Goa known for its stunning views of the Arabian Sea and the merging of two rivers.",
                  "image":"https://images.unsplash.com/photo-1641874308359-4fd2482395d9?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80"
               },
               {
                  "id":7,
                  "name":"Chapora Fort",
                  "description":"Chapora Fort is a popular tourist attraction in Goa, known for its panoramic views of the Arabian Sea and its association with Bollywood movie 'Dil Chahta Hai.'",
                  "image":"https://images.unsplash.com/photo-1642516864457-ef3dcfa02d3a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1772&q=80"
               }
            ],
            "thingsToDo":[
               {
                  "id":1,
                  "name":"Water Sports",
                  "description":"Enjoy thrilling water sports activities like jet skiing, parasailing, banana boat rides, and scuba diving in the pristine waters of Goa.",
                  "image":"https://images.unsplash.com/photo-1597799119438-cbf326f268b9?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2233&q=80"
               },
               {
                  "id":2,
                  "name":"Nightlife",
                  "description":"Experience the vibrant nightlife of Goa at its numerous bars, clubs, and beach shacks. Enjoy live music, DJ performances, and beach parties that go on till the early hours of the morning.",
                  "image":"https://images.unsplash.com/photo-1578736641330-3155e606cd40?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":3,
                  "name":"Spice Plantations",
                  "description":"Visit the spice plantations in Goa and take a tour to learn about various spices like cardamom, cinnamon, and pepper. Experience the aromatic flavors and enjoy traditional Goan meals.",
                  "image":"https://images.unsplash.com/photo-1668733520582-aff1bc6832c7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=654&q=80"
               }
            ],
            "events":[
               {
                  "id":1,
                  "name":"Sunburn Festival",
                  "description":"Sunburn Festival is one of Asia's biggest electronic music festivals held in Goa. It attracts renowned DJs and music enthusiasts from around the world.",
                  "image":"https://images.unsplash.com/photo-1533174072545-7a4b6ad7a6c3?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80",
                  "date":"December"
               },
               {
                  "id":2,
                  "name":"Goa Carnival",
                  "description":"Goa Carnival is a vibrant and colorful celebration that takes place before Lent. Enjoy parades, floats, music, dance, and a lively atmosphere during this festival.",
                  "image":"https://images.unsplash.com/photo-1554451194-beff136a9815?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80",
                  "date":"February"
               },
               {
                  "id":3,
                  "name":"Goa International Jazz Live Festival",
                  "description":"The Goa International Jazz Live Festival showcases a fusion of jazz, funk, soul, and world music. It features renowned international and Indian artists.",
                  "image":"https://images.unsplash.com/photo-1484494789010-20fc1a011197?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1673&q=80",
                  "date":"November"
               }
            ],
            "facts":[
               "Goa is the smallest state in India by area.",
               "The state was a Portuguese colony until 1961, resulting in a unique blend of Indian and Portuguese cultures.",
               "Goa is famous for its sandy beaches, with popular ones including Calangute, Baga, Anjuna, and Palolem.",
               "The state is known as the 'Rome of the East' due to its numerous churches and cathedrals.",
               "Goa is home to a variety of wildlife sanctuaries and national parks, including the famous Bhagwan Mahavir Wildlife Sanctuary and Mollem National Park.",
               "The cuisine of Goa is renowned for its spicy flavors and seafood dishes.",
               "The official language of Goa is Konkani, but English is widely spoken and understood.",
               "The state attracts a large number of tourists from India and abroad, making tourism a significant part of its economy."
            ]
         },
         {
            "id":4,
            "title":"Arunachal Pradesh",
            "cities":[
               {
                  "id":1,
                  "name":"Itanagar",
                  "description":"Itanagar is the capital city of Arunachal Pradesh and a major cultural and commercial hub."
               },
               {
                  "id":2,
                  "name":"Tawang",
                  "description":"Tawang is a town in Arunachal Pradesh, known for its scenic beauty, ancient monasteries, and Tibetan Buddhist culture."
               },
               {
                  "id":3,
                  "name":"Ziro",
                  "description":"Ziro is a beautiful hill station in Arunachal Pradesh, famous for its lush green landscapes, rice fields, and indigenous tribal villages."
               },
               {
                  "id":4,
                  "name":"Dirang",
                  "description":"Dirang is a small town in Arunachal Pradesh, offering panoramic views of the surrounding mountains, hot water springs, and a rich cultural heritage."
               },
               {
                  "id":5,
                  "name":"Bomdila",
                  "description":"Bomdila is a town located at an elevation in Arunachal Pradesh, known for its Buddhist monasteries, apple orchards, and snow-capped mountains."
               }
            ],
            "about":"Arunachal Pradesh is a state in northeastern India, known for its scenic landscapes, diverse tribal culture, and rich biodiversity. It is one of the least explored regions of India and offers breathtaking views of the Eastern Himalayas. The state is home to numerous indigenous tribes, each with its unique traditions and customs. Arunachal Pradesh is also famous for its monasteries, national parks, and adventure tourism opportunities.",
            "attractions":[
               {
                  "id":1,
                  "name":"Tawang Monastery",
                  "description":"Tawang Monastery is the largest monastery in India and a revered Buddhist pilgrimage site in Arunachal Pradesh.",
                  "image":"https://images.unsplash.com/photo-1551461955-89b43c8f4b2f?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":2,
                  "name":"Bomdila Monastery",
                  "description":"Bomdila Monastery is a prominent Buddhist monastery in Arunachal Pradesh, offering panoramic views of the surrounding valleys.",
                  "image":"https://images.unsplash.com/photo-1561731172-e6a4d2a9a409?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":3,
                  "name":"Ziro Valley",
                  "description":"Ziro Valley is a picturesque valley in Arunachal Pradesh, known for its rice fields, scenic beauty, and indigenous tribal villages.",
                  "image":"https://images.unsplash.com/photo-1542467986-13ac00f21339?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1733&q=80"
               },
               {
                  "id":4,
                  "name":"Sela Pass",
                  "description":"Sela Pass is a high-altitude mountain pass in Arunachal Pradesh, offering breathtaking views of snow-capped peaks and lakes.",
                  "image":"https://images.unsplash.com/photo-1640962501301-2f89032c7e88?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2231&q=80"
               },
               {
                  "id":6,
                  "name":"Sangti Valley",
                  "description":"Sangti Valley is a picturesque valley in Arunachal Pradesh, known for its natural beauty, apple orchards, and bird watching.",
                  "image":"https://images.unsplash.com/photo-1595978141469-0f8f9bf9e4ee?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":7,
                  "name":"Parasuram Kund",
                  "description":"Parasuram Kund is a sacred Hindu pilgrimage site in Arunachal Pradesh, known for its natural hot springs and religious significance.",
                  "image":"https://images.unsplash.com/photo-1636453509389-53494df7e51c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1771&q=80"
               },
               {
                  "id":8,
                  "name":"Malinithan",
                  "description":"Malinithan is an archaeological site in Arunachal Pradesh, featuring the ruins of a 14th-century Hindu temple and sculptures.",
                  "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/Malini_Than_temple_complex.jpg/440px-Malini_Than_temple_complex.jpg"
               }
            ],
            "thingsToDo":[
               {
                  "id":1,
                  "name":"Trekking in Tawang",
                  "description":"Embark on a thrilling trekking adventure in Tawang, exploring the mesmerizing beauty of the Himalayan landscapes and remote tribal villages.",
                  "image":"https://images.unsplash.com/photo-1628070031852-5d3080b6e905?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80"
               },
               {
                  "id":2,
                  "name":"Rafting in Kameng River",
                  "description":"Experience the adrenaline rush of river rafting in Kameng River, navigating through the thrilling rapids amidst the pristine natural surroundings of Arunachal Pradesh.",
                  "image":"https://images.unsplash.com/photo-1437482078695-73f5ca6c96e2?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":3,
                  "name":"Visit Tawang Monastery",
                  "description":"Explore the ancient Tawang Monastery, one of the largest monasteries in India, and immerse yourself in the peaceful ambiance of Tibetan Buddhism.",
                  "image":"https://images.unsplash.com/photo-1522136758674-f2c3f5e8603a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1772&q=80"
               },
               {
                  "id":4,
                  "name":"Explore Nuranang Falls",
                  "description":"Witness the majestic beauty of Nuranang Falls, also known as Jang Falls, as the pristine water cascades down amidst the lush greenery of Arunachal Pradesh.",
                  "image":"https://images.unsplash.com/photo-1531512821533-725afd5e366a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2231&q=80"
               },
               {
                  "id":5,
                  "name":"Attend Ziro Music Festival",
                  "description":"Experience the vibrant Ziro Music Festival, a popular outdoor music festival held in the scenic Ziro Valley, showcasing the best of independent music.",
                  "image":"https://images.unsplash.com/photo-1471478331149-c72f17e33c73?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1769&q=80"
               }
            ],
            "events":[
               {
                  "id":1,
                  "name":"Losar Festival",
                  "description":"Celebrate the vibrant Losar Festival, the Tibetan New Year, in Tawang with colorful rituals, traditional dances, and music performances.",
                  "image":"https://images.unsplash.com/photo-1454908027598-28c44b1716c1?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               },
               {
                  "id":2,
                  "name":"Siang River Festival",
                  "description":"Participate in the exhilarating Siang River Festival, a celebration of the Siang River's beauty and its significance to the local communities.",
                  "image":"https://images.unsplash.com/photo-1529434387977-3088f254d77e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1771&q=80"
               },
               {
                  "id":3,
                  "name":"Ziro Festival of Music",
                  "description":"Immerse yourself in the enchanting Ziro Festival of Music, a four-day outdoor music festival featuring renowned artists from across the country.",
                  "image":"https://images.unsplash.com/photo-1524368535928-5b5e00ddc76b?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1770&q=80"
               }
            ],
            "facts":[
               "Arunachal Pradesh is the easternmost state of India, bordering the countries of Bhutan, China, and Myanmar.",
               "The Tawang Monastery in Arunachal Pradesh is the largest monastery in India and the second-largest in the world.",
               "Arunachal Pradesh is known as the 'Land of the Dawn-Lit Mountains' because it is the first place in India to witness the sunrise.",
               "The state of Arunachal Pradesh is home to more than 100 indigenous tribes, each with its distinct languages, cultures, and traditions.",
               "The Namdapha National Park in Arunachal Pradesh is the largest protected area in the Eastern Himalayas and is renowned for its biodiversity."
            ]
         },
         {
            "id":5,
            "title":"Gujarat",
            "cities":[
               {
                  "id":1,
                  "name":"Ahmedabad",
                  "description":"Ahmedabad is the largest city in Gujarat and a major cultural and industrial hub."
               },
               {
                  "id":2,
                  "name":"Surat",
                  "description":"Surat is a bustling city in Gujarat, known for its textile and diamond industries."
               },
               {
                  "id":3,
                  "name":"Vadodara",
                  "description":"Vadodara is a city in Gujarat, famous for its rich history, architecture, and vibrant culture."
               },
               {
                  "id":4,
                  "name":"Rajkot",
                  "description":"Rajkot is a city in Gujarat, known for its textile, jewelry, and watch industries."
               },
               {
                  "id":5,
                  "name":"Gandhinagar",
                  "description":"Gandhinagar is the capital city of Gujarat, known for its well-planned infrastructure and the famous Akshardham temple."
               },
               {
                  "id":6,
                  "name":"Bhuj",
                  "description":"Bhuj is a city in Gujarat, renowned for its rich cultural heritage, historical sites, and proximity to the Rann of Kutch."
               }
            ],
            "about":"Gujarat is a state located in western India, known for its rich cultural heritage, historical sites, and vibrant festivals. The state is famous for its diverse landscapes, including the white salt desert of the Rann of Kutch, the Gir Forest National Park, and the ancient ruins of the Indus Valley Civilization at Dholavira. Gujarat is also renowned for its traditional arts and crafts, lip-smacking cuisine, and warm hospitality.",
            "attractions":[
               {
                  "id":1,
                  "name":"Sabarmati Ashram",
                  "description":"Sabarmati Ashram, located in Ahmedabad, is a historic site associated with Mahatma Gandhi and the Indian independence movement.",
                  "image":"https://images.unsplash.com/photo-1624903715314-3cef94e6bfe7?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2231&q=80"
               },
               {
                  "id":2,
                  "name":"Rani Ki Vav",
                  "description":"Rani Ki Vav is an intricately designed stepwell in Patan, Gujarat, recognized as a UNESCO World Heritage site.",
                  "image":"https://images.unsplash.com/photo-1645336123947-0c13e6a1d6fa?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=654&q=80"
               },
               {
                  "id":3,
                  "name":"Somnath Temple",
                  "description":"Somnath Temple is a famous Hindu temple dedicated to Lord Shiva, located in Somnath, Gujarat.",
                  "image":"https://images.unsplash.com/photo-1591700430569-9469d38b1006?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2228&q=80"
               },
               {
                  "id":4,
                  "name":"Sun Temple",
                  "description":"Sun Temple is a magnificent temple dedicated to the Sun God, located in Modhera, Gujarat.",
                  "image":"https://images.unsplash.com/photo-1590812855152-7d2bc336a5e8?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1754&q=80"
               },
               {
                  "id":5,
                  "name":"Gir Forest National Park",
                  "description":"Gir Forest National Park is a wildlife sanctuary in Gujarat and the only natural habitat of the Asiatic lions.",
                  "image":"https://images.unsplash.com/photo-1624341679500-b3ffeca0df59?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1242&q=80"
               },
               {
                  "id":6,
                  "name":"Dholavira",
                  "description":"Dholavira is an archaeological site in Gujarat, known for its well-preserved ruins of the ancient Indus Valley Civilization.",
                  "image":"https://images.unsplash.com/photo-1669721539500-e283f6702f5c?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               }
            ],
            "thingsToDo":[
               {
                  "id":1,
                  "name":"Explore the Rann of Kutch",
                  "description":"Visit the white salt desert of the Rann of Kutch and experience its surreal beauty, especially during the Rann Utsav festival.",
                  "image":"https://images.unsplash.com/photo-1549468057-5b7fa1a41d7a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1771&q=80"
               },
               {
                  "id":2,
                  "name":"Attend Navratri Festival",
                  "description":"Participate in the vibrant Navratri festival celebrations in Gujarat, known for its colorful traditional dance forms like Garba and Dandiya Raas.",
                  "image":"https://images.unsplash.com/photo-1626094306120-f8dc413aff8e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1771&q=80"
               },
               {
                  "id":3,
                  "name":"Take a Heritage Walk in Ahmedabad",
                  "description":"Join a heritage walk in Ahmedabad and explore the old city's narrow lanes, historic buildings, and intricately carved wooden havelis.",
                  "image":"https://images.unsplash.com/photo-1590637740538-992ea101b700?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":4,
                  "name":"Witness the International Kite Festival",
                  "description":"Enjoy the International Kite Festival in Gujarat, held annually on January 14th, where the sky is filled with colorful kites of various shapes and sizes.",
                  "image":"https://images.unsplash.com/photo-1571849291280-89f81a772893?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1674&q=80"
               },
               {
                  "id":5,
                  "name":"Visit the Statue of Unity",
                  "description":"Marvel at the Statue of Unity, the world's tallest statue dedicated to Sardar Vallabhbhai Patel, located near Vadodara.",
                  "image":"https://images.unsplash.com/photo-1631983097767-099c77bf880d?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=928&q=80"
               },
               {
                  "id":6,
                  "name":"Go Wildlife Safari in Gir Forest",
                  "description":"Embark on a thrilling wildlife safari in Gir Forest National Park and get a chance to spot the majestic Asiatic lions in their natural habitat.",
                  "image":"https://images.unsplash.com/photo-1625123159087-cb41cc220f45?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2911&q=80"
               }
            ],
            "events":[
               {
                  "id":1,
                  "name":"Rann Utsav",
                  "description":"Rann Utsav is a vibrant festival held in the Rann of Kutch, featuring cultural performances, traditional crafts, and camel rides.",
                  "image":"https://images.unsplash.com/photo-1670406312373-6d4d1776e4aa?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1180&q=80",
                  "date":"November - February"
               },
               {
                  "id":2,
                  "name":"International Kite Festival",
                  "description":"The International Kite Festival is a grand celebration of kite flying, where participants from around the world showcase their unique kites.",
                  "iamge":"https://images.unsplash.com/photo-1554234742-92481f1e2e9a?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1644&q=80",
                  "date":"January 14th"
               },
               {
                  "id":3,
                  "name":"Navratri Festival",
                  "description":"Navratri is a nine-night festival dedicated to the worship of Goddess Durga, accompanied by lively Garba and Dandiya Raas dance performances.",
                  "image":"https://images.unsplash.com/photo-1622279487170-dbccd34eda0e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=774&q=80",
                  "date":"September - October"
               },
               {
                  "id":4,
                  "name":"Modhera Dance Festival",
                  "description":"Modhera Dance Festival is a cultural extravaganza held against the backdrop of the Sun Temple in Modhera, showcasing classical and folk dances.",
                  "iamge":"https://www.gujarattourism.com/content/dam/gujrattourism/images/fairs-festivals/modhera-dance-festival/Modhera%20Dance%20large.jpg",
                  "date":"January"
               },
               {
                  "id":5,
                  "name":"Tarnetar Fair",
                  "description":"Tarnetar Fair is a traditional fair held in Tarnetar village, known for its vibrant folk music, dance, and various traditional competitions.",
                  "image":"https://static.toiimg.com/thumb/70958939/tar.jpg?width=1200&height=900",
                  "date":"August - September"
               },
               {
                  "id":6,
                  "name":"Bhavnath Mahadev Fair",
                  "description":"Bhavnath Mahadev Fair is a religious fair held at the Bhavnath Mahadev Temple in Junagadh, attracting thousands of devotees.",
                  "image":"https://images.unsplash.com/photo-1513265662348-bc1a7de98fff?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1769&q=80",
                  "date":"February - March"
               }
            ],
            "facts":[
               " Gujarat is located in the western part of India and shares its borders with Pakistan to the northwest and the Arabian Sea to the southwest.",
               "Gujarat is known for its rich cultural heritage and vibrant traditions. The state celebrates various festivals with enthusiasm, including Navratri, Diwali, and Uttarayan (Kite Festival)",
               "Gujarat is one of the most industrialized states in India and is often referred to as the Growth Engine of India. It is home to several large industrial sectors such as textiles, petrochemicals, pharmaceuticals, engineering, and automotive.",
               "Gujarat has a rich historical background and was an important center of the Indus Valley Civilization. It has been ruled by various dynasties and empires, including the Mauryas, Guptas, Solankis, and Mughals.",
               "The iconic leader Mahatma Gandhi was born in Porbandar, Gujarat. The state holds significant importance in India's freedom struggle, and several landmarks associated with Gandhi, such as Sabarmati Ashram in Ahmedabad, can be visited.",
               "Gujarat boasts several UNESCO World Heritage Sites, including the ancient ruins of Champaner-Pavagadh, Rani ki Vav (Stepwell) in Patan, and the historic city of Ahmedabad.",
               "With a long coastline along the Arabian Sea, Gujarat offers beautiful beaches and coastal attractions such as Mandvi Beach, Dwarka Beach, and Somnath Temple located by the sea.",
               "Gujarat is renowned for its vibrant textile industry, known for its intricate embroidery, tie-and-dye (Bandhani), and traditional handloom weaving. Cities like Ahmedabad and Surat are major textile hubs."
            ]
         },
         {
            "id":6,
            "title":"Kerala",
            "cities":[
               {
                  "id":1,
                  "name":"Thiruvananthapuram",
                  "description":"Thiruvananthapuram, also known as Trivandrum, is the capital city of Kerala and is home to various historical landmarks and beaches."
               },
               {
                  "id":2,
                  "name":"Kochi",
                  "description":"Kochi, also known as Cochin, is a major port city in Kerala and is famous for its backwaters, beaches, and historical landmarks."
               },
               {
                  "id":3,
                  "name":"Kozhikode",
                  "description":"Kozhikode, also known as Calicut, is a coastal city in Kerala and is known for its beaches, historical landmarks, and cuisine."
               },
               {
                  "id":4,
                  "name":"Thrissur",
                  "description":"Thrissur is a cultural and religious hub in Kerala and is famous for its temples, festivals, and art forms."
               },
               {
                  "id":5,
                  "name":"Alappuzha",
                  "description":"Alappuzha, also known as Alleppey, is a popular tourist destination in Kerala and is famous for its backwaters, beaches, and houseboats."
               },
               {
                  "id":6,
                  "name":"Kollam",
                  "description":"Kollam, also known as Quilon, is a coastal city in Kerala and is known for its beaches, backwaters, and historical landmarks."
               }
            ],
            "about":"Kerala, located in the southwestern region of India, is known as 'God's Own Country' for its natural beauty, diverse culture, and rich history. The state is home to numerous beaches, backwaters, hill stations, and wildlife sanctuaries. Kerala offers a blend of natural beauty, historical landmarks, and spiritual experiences.",
            "attractions":[
               {
                  "id":1,
                  "name":"Backwaters of Alleppey",
                  "description":"The backwaters of Alleppey are a network of lagoons, canals, and lakes that offer a unique boating experience amidst the serene natural beauty.",
                  "image":"https://media.istockphoto.com/id/481916851/photo/house-boat-in-backwaters.webp?b=1&s=170667a&w=0&k=20&c=AXjHZjVfZy7dInbpIAhgYSi-ilSihUx2TZP9m3PYE38="
               },
               {
                  "id":2,
                  "name":"Fort Kochi",
                  "description":"Fort Kochi is a historic neighborhood in Kochi that showcases the colonial influence on Kerala's architecture and culture.",
                  "image":"https://media.istockphoto.com/id/664355912/photo/santa-cruz-cathedral-basilica-church-in-fort-kochi-kerala-india.webp?b=1&s=170667a&w=0&k=20&c=1pc7-WaSdLOJmUqhyon1BFyqSrSUYTRlUjwtvptzeEQ="
               },
               {
                  "id":3,
                  "name":"Athirapally Waterfalls",
                  "description":"Athirapally Waterfalls is a scenic waterfall located in Thrissur district that offers breathtaking views amidst the lush green forest.",
                  "image":"https://media.istockphoto.com/id/1348019471/photo/athirapally-waterfall-kerla-india.webp?b=1&s=170667a&w=0&k=20&c=LP4ktfkIc04PLG59IDN_oI8YTQb3R8vVhGPJYBl2-lQ="
               },
               {
                  "id":4,
                  "name":"Tea Plantations of Munnar",
                  "description":"Munnar is a hill station in Kerala that is famous for its tea plantations and scenic beauty.",
                  "image":"https://media.istockphoto.com/id/946810930/photo/tea-plantations-in-kerala-south-india.webp?b=1&s=170667a&w=0&k=20&c=5Zs0VwxbJWHXESnjx1k0OvVnv1RVzp-DyG0MiwFvBQc="
               },
               {
                  "id":5,
                  "name":"Padmanabhaswamy Temple",
                  "description":"Padmanabhaswamy Temple is a famous Hindu temple located in Thiruvananthapuram that showcases the Dravidian style of architecture.",
                  "image":"https://media.istockphoto.com/id/507707260/photo/tea-plantation-in-india.webp?b=1&s=170667a&w=0&k=20&c=E8tHf8S9PE0rfz9rA-d3dcJfLYNs-Orx5xrUCAjo7PY="
               },
               {
                  "id":6,
                  "name":"Bekal Fort",
                  "description":"Bekal Fort is a historic fort located in Kasaragod district that offers panoramic views of the Arabian Sea.",
                  "image":"https://media.istockphoto.com/id/1332351939/photo/kasaragod-kerala-india-august-02-2021-view-of-ancient-historical-fort-namely-bekal-fort.webp?b=1&s=170667a&w=0&k=20&c=2_NlF4AiJTR19lYdZgcFZsnuY-M8IUYMRIkwPKZLYG4="
               }
            ],
            "thingsToDo":[
               {
                  "id":1,
                  "name":"Experience the Backwaters of Alleppey",
                  "description":"Take a boat ride and experience the serene beauty of the backwaters of Alleppey. You can also stay in a houseboat and enjoy the traditional Kerala cuisine while cruising through the backwaters.",
                  "image":"https://media.istockphoto.com/id/510011776/photo/alleppey-backwaters.webp?b=1&s=170667a&w=0&k=20&c=m_E80AEUrdWmTMei6VFts4Wi_Gayy_VC6kMkvUSwXbM="
               },
               {
                  "id":2,
                  "name":"Explore the Wildlife Sanctuaries",
                  "description":"Kerala is home to various wildlife sanctuaries such as Periyar Wildlife Sanctuary, Silent Valley National Park, and Wayanad Wildlife Sanctuary. You can take a jeep safari or trek through the forests to spot various species of animals and birds.",
                  "image":"https://unsplash.com/photos/N9s3FjzsstM"
               },
               {
                  "id":3,
                  "name":"Visit the Hill Stations",
                  "description":"Kerala has several hill stations such as Munnar, Wayanad, and Vagamon that offer breathtaking views of the mountains and valleys. You can go trekking, camping, or just relax amidst the cool climate and natural beauty.",
                  "image":"https://images.unsplash.com/photo-1663597675816-9b5d68952f42?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8N3x8a2VyYWxhJTIwaGlsbHxlbnwwfHwwfHx8MA%3D%3D&auto=format&fit=crop&w=500&q=60"
               },
               {
                  "id":4,
                  "name":"Experience the Ayurvedic Spa",
                  "description":"Kerala is known for its traditional Ayurvedic treatments that offer relaxation and rejuvenation. You can experience various therapies such as massage, yoga, and meditation in the Ayurvedic spas located across the state.",
                  "image":"https://media.istockphoto.com/id/1265403719/photo/karkidaka-rice-soup-or-kanji-herbal-monsoon-food-kerala-india.webp?b=1&s=170667a&w=0&k=20&c=pAVX2EuM3PtcY5Cm26Ao3gxz36rFtXbihlg2AZ0wQSc="
               },
               {
                  "id":5,
                  "name":"Attend the Festivals",
                  "description":"Kerala is known for its vibrant festivals such as Onam, Vishu, and Thrissur Pooram that showcase the culture and traditions of the state. You can witness the colorful processions, fireworks, and traditional performances during these festivals.",
                  "image":"https://media.istockphoto.com/id/1279649394/photo/jackfruit-chips.webp?b=1&s=170667a&w=0&k=20&c=ozJUVcoXLXWpCceYY0h9fY8seoolp5dEAOVI8KTVx-Y="
               },
               {
                  "id":6,
                  "name":"Indulge in the Cuisine",
                  "description":"Kerala cuisine is famous for its spicy and flavorful dishes such as appam, puttu, and fish curry. You can try the traditional dishes in the local restaurants or attend a cooking class to learn how to cook them yourself.",
                  "image":"https://media.istockphoto.com/id/1156896083/photo/cheese-masala-dosa-recipe-with-sambar-and-chutney-selective-focus.webp?b=1&s=170667a&w=0&k=20&c=5IG3QwgKh9ph1O3f0SsodXkFFlHM7EDSFU1KbRqz1ts="
               }
            ],
            "events":[
               {
                  "id":1,
                  "name":"Onam",
                  "description":"Onam is a popular harvest festival in Kerala, celebrated to mark the homecoming of King Mahabali.",
                  "image":"https://media.istockphoto.com/id/1273243432/photo/closeup-of-an-colorful-traditional-indian-art-known-as-rangoli.webp?b=1&s=170667a&w=0&k=20&c=w-SkX2zCdExist3H9WFA1sV9NCmRkJTTlQsDVpVUUA4="
               },
               {
                  "id":2,
                  "name":"Vishu",
                  "description":"Vishu is a Malayalam New Year festival celebrated in Kerala, marked by the first day of the Medam month.",
                  "image":"https://media.istockphoto.com/id/1322434000/photo/vishukkani-or-vishu-sight-kerala-festival.webp?b=1&s=170667a&w=0&k=20&c=s7wMIHvvL7wSus0-zPGRjApGw6XkhbwF9WBIW0Rmy-o="
               },
               {
                  "id":3,
                  "name":"Thrissur Pooram",
                  "description":"Thrissur Pooram is a popular temple festival held at the Vadakkunnathan Temple in Thrissur, Kerala.",
                  "image":"https://media.istockphoto.com/id/484056606/photo/decorated-elephant.webp?b=1&s=170667a&w=0&k=20&c=q_Dw-tIpfbuyIUuDMOoKuEN9Omdn4hTkH78Mc7WL8KU="
               },
               {
                  "id":4,
                  "name":"Nehru Trophy Boat Race",
                  "description":"Nehru Trophy Boat Race is a popular boat race held in the Punnamada Lake in Alappuzha, Kerala.",
                  "image":"https://media.istockphoto.com/id/483722682/photo/traditional-snake-boat-on-the-kerala-backwaters-in-india.webp?b=1&s=170667a&w=0&k=20&c=r9-hT5CGz6ackuZlSELPVjE8jVWumbfX6XE_KiG7Soc="
               },
               {
                  "id":5,
                  "name":"Kerala Literature Festival",
                  "description":"Kerala Literature Festival is an annual literary festival held in Kozhikode, Kerala, which brings together writers, poets, and intellectuals from around the world.",
                  "image":"https://images.unsplash.com/photo-1533174072545-7a4b6ad7a6c3?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8MXx8S2VyYWxhJTIwTGl0ZXJhdHVyZSUyMEZlc3RpdmFsfGVufDB8fDB8fHww&auto=format&fit=crop&w=1000&q=60"
               }
            ],
            "facts":[
               "Kerala is the 22nd largest state in India by area.",
               "The official language of Kerala is Malayalam.",
               "The literacy rate of Kerala is 96.2%.",
               "Kerala has a population of over 33 million people.",
               "The state of Kerala was formed on November 1, 1956.",
               "Kerala shares its borders with Tamil Nadu, Karnataka, and the Lakshadweep Sea.",
               "Kerala is known for its backwaters, beaches, and hill stations.",
               "Kerala has the highest life expectancy and the lowest infant mortality rate in India."
            ]
         }
      ]
   }
]
